## Website CMS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.template_file.cms_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "cms_app" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "DATABASE_HOST"
                          + value = "${db_host}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                      + {
                          + name  = "DATABASE_USERNAME"
                          + value = "${db_user}"
                        },
                    ]
                  + image            = "${image}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-cds-website-cms"
                        }
                    }
                  + name             = "cds-website-cms"
                  + portMappings     = [
                      + {
                          + containerPort = 1337
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "DATABASE_PASSWORD"
                          + valueFrom = "${db_password_arn}"
                        },
                      + {
                          + name      = "TOKEN"
                          + valueFrom = "${github_token_arn}"
                        },
                      + {
                          + name      = "ADMIN_JWT_SECRET"
                          + valueFrom = "${admin_jwt_secret_arn}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "admin_jwt_secret_arn" = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret"
          + "aws_region"           = "ca-central-1"
          + "awslogs-group"        = "ecs-cds-website-cms"
          + "bucket_name"          = "cds-website-assets-prod"
          + "db_host"              = "strapi.cnpapuat1xtk.ca-central-1.rds.amazonaws.com"
          + "db_password_arn"      = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password"
          + "db_user"              = "postgres"
          + "fargate_cpu"          = "1024"
          + "fargate_memory"       = "2048"
          + "github_token_arn"     = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token"
          + "image"                = "773858180673.dkr.ecr.ca-central-1.amazonaws.com/cds-website/cms"
        }
    }

  # aws_db_instance.website-cms-database will be updated in-place
  ~ resource "aws_db_instance" "website-cms-database" {
      ~ engine_version                        = "14.10" -> "14.7"
        id                                    = "strapi"
        name                                  = "strapi"
        tags                                  = {
            "CostCenter" = "website-cms"
            "Name"       = "website-cms-database"
        }
        # (48 unchanged attributes hidden)
    }

  # aws_ecs_service.website-cms-ecs will be updated in-place
  ~ resource "aws_ecs_service" "website-cms-ecs" {
        id                                 = "arn:aws:ecs:ca-central-1:773858180673:service/website-cms-cluster/website-cms-ecs"
        name                               = "website-cms-ecs"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:65" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.cds-website-cms must be replaced
-/+ resource "aws_ecs_task_definition" "cds-website-cms" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:64" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "cds-website-assets-prod"
                        },
                      - {
                          - name  = "DATABASE_HOST"
                          - value = "strapi.cnpapuat1xtk.ca-central-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DATABASE_USERNAME"
                          - value = "postgres"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                    ]
                  - essential        = true
                  - image            = "773858180673.dkr.ecr.ca-central-1.amazonaws.com/cds-website/cms"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "ecs-cds-website-cms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-cds-website-cms"
                        }
                    }
                  - mountPoints      = []
                  - name             = "cds-website-cms"
                  - portMappings     = [
                      - {
                          - containerPort = 1337
                          - hostPort      = 1337
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password"
                        },
                      - {
                          - name      = "TOKEN"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token"
                        },
                      - {
                          - name      = "ADMIN_JWT_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "website-cms-task" -> (known after apply)
      ~ revision                 = 64 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.api_token_salt will be created
  + resource "aws_ssm_parameter" "api_token_salt" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/website/api_token_salt"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Error: Incorrect attribute value type

  on iam.tf line 54, in data "aws_iam_policy_document" "ecs-task-execution":
  54:     resources = [
  55:       aws_ssm_parameter.db_password.arn,
  56:       aws_ssm_parameter.github_token.arn,
  57:       aws_ssm_parameter.admin_jwt_secret.arn,
  58:       aws_ssm_parameter.api_token_salt
  59:     ]
    ├────────────────
    │ aws_ssm_parameter.admin_jwt_secret.arn is "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret"
    │ aws_ssm_parameter.api_token_salt is object with 14 attributes
    │ aws_ssm_parameter.db_password.arn is "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password"
    │ aws_ssm_parameter.github_token.arn is "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token"

Inappropriate value for attribute "resources": element 3: string required.
time=2024-04-11T19:56:52Z level=error msg=terraform invocation failed in /home/runner/work/cds-website-terraform/cds-website-terraform/terragrunt/website-cms/.terragrunt-cache/Rta2T_QZ9JTfHwmdD5c1LptsjFU/G2mAX9eDxVPPZUycbL6JKzZ_ogo/website-cms prefix=[/home/runner/work/cds-website-terraform/cds-website-terraform/terragrunt/website-cms] 
time=2024-04-11T19:56:52Z level=error msg=1 error occurred:
	* [/home/runner/work/cds-website-terraform/cds-website-terraform/terragrunt/website-cms/.terragrunt-cache/Rta2T_QZ9JTfHwmdD5c1LptsjFU/G2mAX9eDxVPPZUycbL6JKzZ_ogo/website-cms] exit status 1



```

</details>

